---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCLevelInfo.GetRelatedProducts
source: html/19a994a0-bdac-9b9e-61b0-c2bec6869dd0.htm
---
# Autodesk.Revit.DB.IFC.IFCLevelInfo.GetRelatedProducts Method

Gets all building products on this level.

## Syntax (C#)
```csharp
public ICollection<IFCAnyHandle> GetRelatedProducts()
```

## Returns
The collection of products.